#include <stdio.h>
int main() {
    int i = 1;                    // กำหนดค่าเริ่มต้น i = 1

    while (i <= 10) {             // ตรวจสอบเงื่อนไข i <= 10 ก่อนเข้าลูป
        if (i == 6) {             // ถ้า i เท่ากับ 6
            i++;                  // เพิ่มค่า i ก่อน ไม่งั้นจะวนลูปค้าง
            continue;             // ข้าม printf แล้วกลับไปตรวจเงื่อนไขใหม่
        }
        printf("%d ", i);         // แสดงค่าของ i
        i++;                      // เพิ่มค่า i ทีละ 1
    }
    return 0;                     // จบโปรแกรม
}

// การทำงานของ cotinue คือ เมื่อเจอคำสั่งนี้ในลูป จะข้ามการทำงานที่เหลือในลูปนั้นๆ แล้วกลับไปตรวจสอบเงื่อนไขของลูปใหม่ทันที
// ดังนั้นเมื่อ i = 6 จะไม่แสดงผล 6 ออกมา
// ผลลัพธ์ที่ได้จะเป็นการแสดงเลข 1 ถึง 10 ยกเว้นเลข 6 ออกมา

// การทำงานของ while loop คือ จะตรวจสอบเงื่อนไขก่อนเข้าลูปทุกครั้ง 
// ถ้าเงื่อนไขเป็นจริง (true) จะทำงานในลูปต่อไปเรื่อยๆ จนกว่าเงื่อนไขจะเป็นเท็จ (false) ถึงจะออกจากลูป