#include <stdio.h>
int main() {
    int i = 1;                    // กำหนดค่าเริ่มต้น i = 1

    do {                          // ทำงานในบล็อกนี้อย่างน้อย 1 ครั้ง
        if (i == 6) {             // ถ้า i เท่ากับ 6
            i++;                  // เพิ่มค่า i ก่อน ไม่งั้นจะวนค้าง
            continue;             // ข้าม printf แล้วไปเช็กเงื่อนไข while
        }
        printf("%d ", i);         // แสดงค่าของ i
        i++;                      // เพิ่มค่า i ทีละ 1
    } while (i <= 10);            // ตรวจสอบเงื่อนไข ถ้า i <= 10 ทำต่อ
    return 0;                     // จบโปรแกรม
}

// การทำงานของ do-while loop คือ จะทำงานในบล็อกนี้อย่างน้อย 1 ครั้ง แล้วจึงตรวจสอบเงื่อนไขที่ส่วนท้ายของลูป
// ดังนั้นเมื่อ i = 6 จะไม่แสดงผล 6 ออกมา
// ผลลัพธ์ที่ได้จะเป็นการแสดงเลข 1 ถึง 10 ยกเว้นเลข 6 ออกมา

//สรุปเเละอภิปรายผลการทำงานของ continue กับ do-while loop ร่วมกับ continue
// การทำงานของ cotinue คือ เมื่อเจอคำสั่งนี้ในลูป จะข้ามการทำงานที่เหลือในลูปนั้นๆ แล้วกลับไปตรวจสอบเงื่อนไขของลูปใหม่ทันที
// ดังนั้นเมื่อ i = 6 จะไม่แสดงผล 6 ออกมา
// ผลลัพธ์ที่ได้จะเป็นการแสดงเลข 1 ถึง 10 ยกเว้นเลข 6 ออกมา
// การทำงานของ do-while loop คือ จะทำงานในบล็อกนี้อย่างน้อย 1 ครั้ง แล้วจึงตรวจสอบเงื่อนไขที่ส่วนท้ายของลูป
// ดังนั้นเมื่อ i = 6 จะไม่แสดงผล 6 ออกมา
// ผลลัพธ์ที่ได้จะเป็นการแสดงเลข 1 ถึง 10 ยกเว้นเลข 6 ออกมา
// สรุปคือ การใช้ continue ร่วมกับ do-while loop ทำให้สามารถข้ามการแสดงผลของเลขที่ต้องการได้อย่างมีประสิทธิภาพ
// ผลลัพธ์ที่ได้จะเป็นการแสดงเลข 1 ถึง 10 ยกเว้นเลข 6 ออกมา